[
  {
    "id": 1,
    "title": "Html 5 basic to advanced 2022",
    "thumbnail": "https://cdn5.f-cdn.com/contestentries/1162950/18299824/59efa1ae1a01a_thumb900.jpg",
    "price": 13.99,
    "instructor": "Tom Cruise",
    "duration": "5 Hours",
    "total_videos": 50,
    "description": "*** The #1 bestselling HTML and CSS course on Udemy! *** *** Completely re-built from scratch in July 2021 (35+ hours video) *** 'Having gone through other related courses on other platforms, I can say this course is the most practical and readily applicable course on web design and development I have taken.' — Bernie Pacis Open a new browser tab, type in www.omnifood.dev, and take a look around. I will wait here... Amazing, right? What if you knew exactly how to design and build a website like that, completely from scratch? How amazing would that be? Well, I'm here to teach you HTML, CSS, and web design, all by building the stunning website that you just saw, step-by-step. So, after finishing this course, you will know exactly how to build a beautiful, professional, and ready-to-launch website just like Omnifood, by following a 7-step process. And it will even look great on any computer, tablet, and smartphone. But what if you want to build a completely different website? Well, no problem! I designed the course curriculum with exactly this goal: to enable you to design and build any website that you can think of, not just copy the course project. So, in order to become a confident and independent developer, capable of building your own websites in the future, you will learn: The fundamentals of modern and semantic HTML, CSS, and building layouts in a small separate project, which will prepare you for the main course project (www.omnifood.dev). This includes modern flexbox and CSS Grid! How to design beautiful websites, by learning a web design framework I created just for this course. It consists of easy-to-use guidelines for design aspects like typography, colors, images, spacing, and more (this is like a small standalone course!). How to use well-established website components and layout patterns in order to come up with professional-looking designs How to make any website work on any mobile device, no matter the design and layout (responsive design) How to use the 7 steps of building a professional website in practice: planning, sketching, designing, building, testing, optimizing, and launching How to find and use free design assets such as images, fonts, and icons Important developer skills such as reading documentation, fixing code errors on your own, and using professional web development tools Does this sound like fun? Then join me and 200,000+ other developers and start building websites today! Or are you not sold yet and need to know more? No problem, just keep reading... [01] Why should you learn HTML and CSS in the first place? Building websites allows you to do fun and creative work, from anywhere in the world, and it even pays well. Web development is one of the most future-proof and highest-paying industries in the world. And HTML and CSS is the entry point to this world! But you already know all this, that's why you want to learn HTML and CSS too. Well, you came to the right place! This is the best and most complete course for starting your web development journey that you will find on Udemy. It's an all-in-one package that takes you from knowing nothing about HTML and CSS, to building beautiful websites using tools and technologies that professional web developers use every single day. [02] Why is this course so unique and popular? Reason #1: The course is completely project-based Simple demos are boring, and therefore you're gonna learn everything by building actual projects! In the final project (www.omnifood.dev), together we hand-code a beautiful and responsive landing page for a fictional company that I made up just for the course. Reason #2: You will not just learn how to code Coding is great, but it's not everything! That's why we will go through the entire 7-step process of building and launching our website project. So the huge Omnifood project will teach you real-world skills to build real-world HTML and CSS websites: how to plan projects and page layouts, how to implement designs using HTML and CSS techniques, how to write clean and organized code, how to optimize websites for good speed performance, and many more. On top of that, this course has a huge focus on beautiful design. In fact, this is the only course on the market that focuses on both coding and designing, together. Reason #3: I'm the right teacher for you With the right guidance and a well-structured curriculum, building websites can be quite easy and fun to learn. With a bunch of random tutorials and YouTube videos? Not so much. And that's where I come in. My name is Jonas, I'm an experienced web developer and designer, and one of Udemy's top instructors. I have been teaching this bestselling course since 2015 to over 200,000 developers, always listening to feedback and understanding exactly how students actually learn. Using that feedback, I recently rebuilt this course from scratch and designed the ideal course curriculum for every type of student. It's a unique blend of projects, deep explanations, theory lectures, and challenges. I'm sure you're gonna love it! [03] Why is this course so long? Reason #1: I take time to explain every single concept that I teach, so that you actually learn, and not just copy code from the screen (this is a course, not a tutorial) Reason #2: I go into topics that other HTML and CSS courses shy away from: professional web design, component and layout patterns, some CSS theory, website planning in theory and practice, and developer skills. I believe you need all of this to be successful! Reason #3: There is a lot of repetition, so that you actually assimilate and practice what you learn. Practice is the single most important ingredient to learning, and therefore I provide plenty of opportunities for you to sharpen your skills [04] Here is what's also included in the package: Up-to-date HD-quality videos, that are easy to search and reference (great for Udemy Business students) Professional English captions (not the auto-generated ones) Downloadable design assets + starter code and final code for each section Downloadable slides for 20+ theory videos (not boring, I promise!) Access to countless free design and development resources that I curated over many years Free support in the course Q&A 10+ coding challenges to practice your new skills (solutions included) [05] This course is for you if... ... you are a complete beginner with no idea of how to build a website. ... you already know a bit of HTML and CSS from some tutorials or videos, but struggle to put together a good-looking, complete website. ... you are a designer and want to expand your skills into HTML and CSS, because all your designer friends are learning how to code (they are smart!). Basically, if you are an HTML and CSS master, and build the most beautiful websites in the world, then DON'T take the course. Everyone else: you should take the course, today. So, does all of this sound great? Then join me and 200,000+ other developers and start your web development journey today!"
  },
  {
    "id": 2,
    "title": "Css 3 basic to advanced 2022",
    "thumbnail": "https://d28rtuv7aawte3.cloudfront.net/uploads/thumbnails/course_thumbnails/course_thumbnail_efanew_48.jpg",
    "price": 12.99,
    "instructor": "Brad Pitt",
    "duration": "6 Hours",
    "total_videos": 55,
    "description": "*** The #1 bestselling HTML and CSS course on Udemy! *** *** Completely re-built from scratch in July 2021 (35+ hours video) *** 'Having gone through other related courses on other platforms, I can say this course is the most practical and readily applicable course on web design and development I have taken.' — Bernie Pacis Open a new browser tab, type in www.omnifood.dev, and take a look around. I will wait here... Amazing, right? What if you knew exactly how to design and build a website like that, completely from scratch? How amazing would that be? Well, I'm here to teach you HTML, CSS, and web design, all by building the stunning website that you just saw, step-by-step. So, after finishing this course, you will know exactly how to build a beautiful, professional, and ready-to-launch website just like Omnifood, by following a 7-step process. And it will even look great on any computer, tablet, and smartphone. But what if you want to build a completely different website? Well, no problem! I designed the course curriculum with exactly this goal: to enable you to design and build any website that you can think of, not just copy the course project. So, in order to become a confident and independent developer, capable of building your own websites in the future, you will learn: The fundamentals of modern and semantic HTML, CSS, and building layouts in a small separate project, which will prepare you for the main course project (www.omnifood.dev). This includes modern flexbox and CSS Grid! How to design beautiful websites, by learning a web design framework I created just for this course. It consists of easy-to-use guidelines for design aspects like typography, colors, images, spacing, and more (this is like a small standalone course!). How to use well-established website components and layout patterns in order to come up with professional-looking designs How to make any website work on any mobile device, no matter the design and layout (responsive design) How to use the 7 steps of building a professional website in practice: planning, sketching, designing, building, testing, optimizing, and launching How to find and use free design assets such as images, fonts, and icons Important developer skills such as reading documentation, fixing code errors on your own, and using professional web development tools Does this sound like fun? Then join me and 200,000+ other developers and start building websites today! Or are you not sold yet and need to know more? No problem, just keep reading... [01] Why should you learn HTML and CSS in the first place? Building websites allows you to do fun and creative work, from anywhere in the world, and it even pays well. Web development is one of the most future-proof and highest-paying industries in the world. And HTML and CSS is the entry point to this world! But you already know all this, that's why you want to learn HTML and CSS too. Well, you came to the right place! This is the best and most complete course for starting your web development journey that you will find on Udemy. It's an all-in-one package that takes you from knowing nothing about HTML and CSS, to building beautiful websites using tools and technologies that professional web developers use every single day. [02] Why is this course so unique and popular? Reason #1: The course is completely project-based Simple demos are boring, and therefore you're gonna learn everything by building actual projects! In the final project (www.omnifood.dev), together we hand-code a beautiful and responsive landing page for a fictional company that I made up just for the course. Reason #2: You will not just learn how to code Coding is great, but it's not everything! That's why we will go through the entire 7-step process of building and launching our website project. So the huge Omnifood project will teach you real-world skills to build real-world HTML and CSS websites: how to plan projects and page layouts, how to implement designs using HTML and CSS techniques, how to write clean and organized code, how to optimize websites for good speed performance, and many more. On top of that, this course has a huge focus on beautiful design. In fact, this is the only course on the market that focuses on both coding and designing, together. Reason #3: I'm the right teacher for you With the right guidance and a well-structured curriculum, building websites can be quite easy and fun to learn. With a bunch of random tutorials and YouTube videos? Not so much. And that's where I come in. My name is Jonas, I'm an experienced web developer and designer, and one of Udemy's top instructors. I have been teaching this bestselling course since 2015 to over 200,000 developers, always listening to feedback and understanding exactly how students actually learn. Using that feedback, I recently rebuilt this course from scratch and designed the ideal course curriculum for every type of student. It's a unique blend of projects, deep explanations, theory lectures, and challenges. I'm sure you're gonna love it! [03] Why is this course so long? Reason #1: I take time to explain every single concept that I teach, so that you actually learn, and not just copy code from the screen (this is a course, not a tutorial) Reason #2: I go into topics that other HTML and CSS courses shy away from: professional web design, component and layout patterns, some CSS theory, website planning in theory and practice, and developer skills. I believe you need all of this to be successful! Reason #3: There is a lot of repetition, so that you actually assimilate and practice what you learn. Practice is the single most important ingredient to learning, and therefore I provide plenty of opportunities for you to sharpen your skills [04] Here is what's also included in the package: Up-to-date HD-quality videos, that are easy to search and reference (great for Udemy Business students) Professional English captions (not the auto-generated ones) Downloadable design assets + starter code and final code for each section Downloadable slides for 20+ theory videos (not boring, I promise!) Access to countless free design and development resources that I curated over many years Free support in the course Q&A 10+ coding challenges to practice your new skills (solutions included) [05] This course is for you if... ... you are a complete beginner with no idea of how to build a website. ... you already know a bit of HTML and CSS from some tutorials or videos, but struggle to put together a good-looking, complete website. ... you are a designer and want to expand your skills into HTML and CSS, because all your designer friends are learning how to code (they are smart!). Basically, if you are an HTML and CSS master, and build the most beautiful websites in the world, then DON'T take the course. Everyone else: you should take the course, today. So, does all of this sound great? Then join me and 200,000+ other developers and start your web development journey today!"
  },
  {
    "id": 3,
    "title": "JavaScript basic to advanced 2022",
    "thumbnail": "https://res.cloudinary.com/practicaldev/image/fetch/s--2aQBiPNP--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/769cuap96tu5s653bzld.jpg",
    "price": 13.99,
    "instructor": "James Bond",
    "duration": "6 Hours",
    "total_videos": 55,
    "description": "*** The #1 bestselling JavaScript course on Udemy! *** *** Just updated for latest ES2021 and ES2022 features *** 'Really, really well made course. Super in-depth, with great challenges and projects that will solidify your Javascript understanding. I found the lectures were paced perfectly -- Jonas doesn't skip over anything that might be useful to a JS developer' — Carson Bartholomew JavaScript is the most popular programming language in the world. It powers the entire modern web. It provides millions of high-paying jobs all over the world. That's why you want to learn JavaScript too. And you came to the right place! Why is this the right JavaScript course for you? This is the most complete JavaScript course on Udemy. It's an all-in-one package that will take you from the very fundamentals of JavaScript, all the way to building modern and complex applications. You will learn modern JavaScript from the very beginning, step-by-step. I will guide you through practical and fun code examples, important theory about how JavaScript works behind the scenes, and beautiful and complete projects. You will also learn how to think like a developer, how to plan application features, how to architect your code, how to debug code, and a lot of other real-world skills that you will need on your developer job. And unlike other courses, this one actually contains beginner, intermediate, advanced, and even expert topics, so you don't have to buy any other course in order to master JavaScript from the ground up! But... You don't have to go into all these topics. This is a huge course, because, after all, it's 'The Complete JavaScript Course'. In fact, it's like many courses in one! But you can become an excellent developer by watching only parts of the course. That's why I built this course in a very modular way, and designed pathways that will take you through the course faster. By the end of the course, you will have the knowledge and confidence that you need in order to ace your job interviews and become a professional developer. Why am I the right JavaScript teacher for you? My name is Jonas, I'm an experienced web developer and designer, and one of Udemy's top instructors. I have been teaching this bestselling course since 2016 to over 400,000 developers, always listening to feedback and understanding exactly how students actually learn. Recently, I took all my teaching experience to build this new and greatly improved JavaScript course. It's now the best and most in-depth JavaScript course that you will find on Udemy (and maybe the entire internet). I know how students learn JavaScript and what they need in order to master it. And with that knowledge, I designed the ideal course curriculum. It's a unique blend of real-world projects, deep explanations, theory lectures, and challenges, that will take you from zero to an expert and confident JavaScript developer in just a couple of weeks. So what exactly is covered in the course? Build 5 beautiful real-world projects for your portfolio! In these projects, you will learn how to plan and architect your applications using flowcharts and common JavaScript patterns Master the JavaScript fundamentals: variables, if/else, operators, boolean logic, functions, arrays, objects, loops, strings, and more Learn modern JavaScript (ES6+) from the beginning: arrow functions, destructuring, spread operator, default arguments, optional chaining (ES2020), and more How JavaScript works behind the scenes: engines, the call stack, hoisting, scoping, the 'this' keyword, reference values, and more. Deep dive into functions: arrow functions, first-class and higher-order functions, bind, and closures. Deep dive into object-oriented programming: prototypal inheritance, constructor functions (ES5), classes (ES6), encapsulation, abstraction, inheritance, and polymorphism. [This is like a small standalone course] Deep dive into asynchronous JavaScript: the event loop, promises, async/await, and error handling. You will use these to access data from third-party APIs with AJAX calls. [This is like a small standalone course] Learn modern tools that are used by professional web developers: NPM, Parcel (module bundler), Babel, and ES6 modules Check out the course curriculum for an even more detailed overview of the content :) This is what's also included in the package: Up-to-date HD-quality videos, that are easy to search and reference (great for Udemy for Business students) Professional English captions (not the auto-generated ones) Downloadable starter code and final code for each section Downloadable slides for 40+ theory videos (not boring, I promise!) Free support in the course Q&A 25+ coding challenges and 25+ assignments to practice your new skills (solutions included) This course is for you if... ... you want to gain a true and deep understanding of JavaScript ... you have been trying to learn JavaScript but: 1) still don't really understand JavaScript, or 2) still don't feel confident to code real apps ... you are interested in using a library/framework like React, Angular, Vue, or Node.js in the future ... you already know JavaScript and are looking for an advanced course. This course includes expert topics! ... you want to get started with programming: JavaScript is a great first language! Does any of these look like you? If so, then start this adventure today, and join me and 400,000+ other developers in the only JavaScript course that you will ever need!"
  },
  {
    "id": 4,
    "title": "ReactJs basic to advanced 2022",
    "thumbnail": "https://www.achieversit.com/uploads/course_image/react-img2.png",
    "price": 19.99,
    "instructor": "Dwayne Jhonson",
    "duration": "20 Hours",
    "total_videos": 120,
    "description": "This course is fully up-to-date with React 18 (the latest version of React)! It was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know! This course also comes with two paths which you can take: The 'complete' path (full >40h course) and the 'summary' path (~4h summary module) - you can choose the path that best fits your time requirements! :-) React.js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web. This course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well. You'll get all the theory, tons of examples and demos, assignments and exercises and tons of important knowledge that is skipped by most other resources - after all, there is a reason why this course is that huge! :) And in case you don't even know why you would want to learn React and you're just here because of some ad or 'the algorithm' - no worries: ReactJS is a key technology as a web developer and in this course I will also explain WHY it's that important! Welcome to 'React - The Complete Guide'! This course will teach you React.js in a practice-oriented way, using all the latest patterns and best practices you need. You will learn all the key fundamentals as well as advanced concepts and related topics to turn you into a React.js developer. This is a huge course because it really covers EVERYTHING you need to know and learn to become a React.js developer! No matter if you know nothing about React or if you already got some basic React knowledge (not required but also not a problem), you will get tons of useful information and knowledge out of this course! My goal with this course is to ensure that you feel confident working with React, so that you can apply for React jobs, use it in your own projects or simply enhance your portfolio as a developer - whatever your goal is: This course gets you there! I originally created this course in 2017 and I have kept it updated since that - redoing it from the ground up in 2021. And of course I'm dedicated to keeping this course up-to-date - so that you can rely on this course to learn React in the best possible way! What's in this course? A thorough introduction to React.js (What is it and why would you use it?) All the core basics: How React works, building components with React & building UIs with React Components, props & dynamic data binding Working with user events and state to create interactive applications A (thorough) look behind the scenes to understand how React works under the hood Detailed explanations on how to work with lists and conditional content React Hooks (in-depth)! Working with built-in Hooks and building custom Hooks How to debug React apps Styling React apps with 'Styled Components' and 'CSS Modules' Working with 'Fragments' & 'Portals' Dealing with side effects Class-based components and functional components Sending Http requests & handling transitional states + responses Handling forms and user input (incl. validation) Redux & Redux Toolkit Routing with React Router An in-depth introduction into Next.js Deploying React Apps Implementing Authentication Unit Tests Combining React with TypeScript Adding Animations Tons of examples and demo projects so that you can apply all the things you learned in real projects And so much more - check out the full curriculum on this page! This really is the 'Complete Guide' - promised! And best of all? You don't need any prior React knowledge! This course starts with zero knowledge assumed! All you need is basic web development and JavaScript knowledge (though the course even includes a brief JavaScript refresher to ensure that we're all on the same page!). Check out the full curriculum, the free preview videos and join the course risk-free thanks to the 30-day money-back guarantee!"
  },
  {
    "id": 5,
    "title": "NodeJs basic to advanced 2022",
    "thumbnail": "https://cdn.gabrieleromanato.com/5c37214980b3/uploads/2018/09/nodejs.jpg",
    "price": 16.99,
    "instructor": "Robert Downey Jr.",
    "duration": "8 Hours",
    "total_videos": 60,
    "description": "Join the most comprehensive Node.js course on Udemy and learn Node in both a practical as well as theory-based way! This course was updated to also include sections on Deno.js - in addition to more than 30 hours of content on Node.js! Node.js is probably THE most popular and modern server-side programming language you can dive into these days! Node.js developers are in high demand and the language is used for everything from traditional web apps with server-side rendered views over REST APIs all the way up to GraphQL APIs and real-time web services. Not to mention its applications in build workflows for projects of all sizes. This course will teach you all of that! From scratch with zero prior knowledge assumed. Though if you do bring some knowledge, you'll of course be able to quickly jump into the course modules that are most interesting to you. Here's what you'll learn in this course: Node.js Basics & Basic Core Modules Parsing Requests & Sending Responses Rendering HTML Dynamically (on the Server) Using Express.js Working with Files and generating PDFs on the Server (on-the-fly) File Up- and Download Using the Model-View-Controller (MVC) Pattern Using Node.js with SQL (MySQL) and Sequelize Using Node.js with NoSQL (MongoDB) and Mongoose Working with Sessions & Cookies User Authentication and Authorization Sending E-Mails Validating User Input Data Pagination Handling Payments with Stripe.js Building REST APIs Authentication in REST APIs File Upload in REST APIs Building GraphQL APIs Authentication in GraphQL APIs File Upload in GraphQL APIs Building a Realtime Node.js App with Websockets Automated Testing (Unit Tests) Deploying a Node.js Application Using TypeScript with Node.js Exploring Deno.js And Way More! Does this look like a lot of content? It certainly is! This is not a short course but it is the 'Complete Guide' on Node.js after all. We'll dive into a lot of topics and we'll not just scratch the surface. We'll also not just walk through boring theory and some slides. Instead, we'll build two major projects: An online shop (including checkout + payments) and a blog. All topics and features of the course will be shown and used in these projects and you'll therefore learn about them in a realistic environment. Is this course for you? If you got no Node.js experience, you'll love this course because it starts with zero knowledge assumed. It's the perfect course to become a Node.js developer. If you got basic Node.js experience, this course is also a perfect match because you can go through the basic modules quickly and you'll benefit from all the deep dives and advanced topics the course covers. Are you an advanced Node.js user? Check the curriculum then. Maybe you found no other course that shows how to use SQL with Node.js. Or you're interested in GraphQL. Chances are, that you'll get a lot of value out of this course, too! Prerequisites NO Node.js knowledge is required at all! NO other programming language knowledge (besides JavaScript, see next point) is required Basic JavaScript knowledge is assumed though - you should at least be willing to pick it up whilst going through the course. A JS refresher module exists to bring you up to the latest syntax quickly Basic HTML + CSS knowledge helps but is NOT required"
  },
  {
    "id": 6,
    "title": "MongoDB basic to advanced 2022",
    "thumbnail": "https://dbpyje2nswhci.cloudfront.net/images/meta_generic.png",
    "price": 17.99,
    "instructor": "Leonardo Dcaprio",
    "duration": "3 Hours",
    "total_videos": 30,
    "description": "Join this bestselling MongoDB course to learn all about this extremely popular database and query language from the ground up, in great detail and with many practical examples! MongoDB is one of the most important NoSQL databases you can work with these days. It's extremely popular and MongoDB developers are in high demand. No matter if you're building web applications, mobile applications or any other kind of application or if you're a data scientist - you'll need to work with data. Storing data, querying it efficiently and minimizing complexities whilst optimizing performance are crucial tasks. MongoDB makes working with data simple - it's built on a philosophy that prioritizes performance and efficiency. In this course, you'll learn all about MongoDB from scratch. No prior MongoDB or database experience is required! In detail, you'll learn: ... how to install and use MongoDB locally and in the cloud (MongoDB Atlas) ... how to perform CRUD (Create, Read, Update, Delete) operations on MongoDB databases ... how to filter for data efficiently ... how to work with both the Mongo Shell and drivers (e.g. Node.js driver) ... how to increase performance by using indexes (and how to use the right indexes!) ... how to use the amazing 'Aggregation Framework' that's built into MongoDB ... what replica sets and sharding are ... how to use MongoDB Atlas - the cloud solution offered by MongoDB ... how to use the serverless platform (Stitch) offered by MongoDB ... and much more! This course is a hands-on course - you'll learn by writing code/ commands. We'll work on a wide variety of example data and use-cases and by the end of the course, you'll have all the knowledge you need to work with MongoDB in your next project! This course is for you, no matter which programming language you plan on using, you'll learn a uniform way of interacting with MongoDB that can be easily applied to any language. This course is for you: ... if you're brand-new to MongoDB and databases in general ... if you got some basic database or even MongoDB experience - in this course, there are different entry points you can choose from! ... if you are a web or mobile app (or desktop app) developer who considers using MongoDB ... if you're working in a team that considers using MongoDB (or already does use it) ... if you are primarily using SQL-based databases so far and you want to explore the most popular NoSQL alternative This course is NOT for you: ... if you're looking for a guide on administrating MongoDB servers => This course focuses on the commands/ queries you write, it's NOT an administration course. I will show (in detail) how to deploy a ready-to-use cloud MongoDB solution that follows best practices though."
  }
]
